# print("Hello world")
# print('Hello world')

# a = 10
# login = "admin"
# password = 'qwerty'
# line = "I\n\t\\love\\\n\t\t\"Python\""
# line2 = "\\n - перехід на новий рядок"
# raw_line = r"\n - перехід на новий рядок"
# img = '''
#                                          .:^~!!777?77!!~^:.                                         
#                                  .:^  ~YB&&@@@@@@@@@@@@@@&&B57.^~:                                  
#                                 ^!?Y^.Y7!5@@@@@@@@@@@@@@@#Y7! ~GBG5J!^.                             
#                          .^~7?J55PPP5P@@#?~G@@@@@@@@@@@&?~Y&#!?YYYYJJ?!:.                           
#                        :7?JYYYYYJ7!^^^~7JPY:?@@@@@@@@@P^J#BP5J?7!!7JJ??7!^:                         
#                      !P&@@@@@&PJ??JY555YJ7!^ 7&@@@@@@Y ^??JY555YJ7!!?P&@&&##BP!.                    
#                   .?B@@@@@@G7!JB&@@@@@@@@@@&G?!J#@@P!~YB&@@@@@@@@@@#P?!Y&@@@@@@#?.                  
#                  ?#@@@@@@#!~P@@@@@@@@@@@@@@@@@&Y^?!!G@@@@@@@@@@@@@@@@@#J^Y@@@@@@@#?.                
#                ~B@@@@@@@G:Y@@@@@@@@@@@@@@@@@@@@@&?5@@@@@@@@@@@@@@@@@@@@@#~!&@@@@@@@B!               
#              .Y@@@@@@@@G.P@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!~@@@@@@@@@5.             
#             ^B@@@@@@@@&.Y@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@:?@@@@@@@@@#^            
#            ~&@@@@@@@@@J:@@@@@@@@@@@@@@@@@BJ777YB@@@@BJ77?YB@@@@@@@@@@@@@@@@P.#@@@@@@@@@&!           
#           ~&@@@@@@@@@@~7@@@@@@@@@@@@@@@&!.?7    7&&!.?7    7&@@@@@@@@@@@@@@# P@@@@@@@@@@@!          
#          ^&@@@@@@@@@@@~7@@@@@@@@@@@@@@@Y .J?     5Y .J?     Y@@@@@@@@@@@@@@&.P@@@@@@@@@@@@~         
#         .#@@@@&BGPPB@@?^@@@@@@@@@@@@@@@G.       .BB.       .B@@@@@@@@@@@@@@G B@@BPPG#@@@@@&:        
#         !GPPP?7?Y5Y5@@B G@@@@@@@@@@@@@@@B?^...^?B@@B?^...^?#@@@@@@@@@@@@@@@!~@@@YY5Y?7JPPPG7        
#      .~?Y5Y. ^?7~?&@@@@J:#@@@@@@@@@@@@@@@@@&#&@@@@@@@@&#&@@@@@@@@@@@@@@@@@Y.#@@@@&7~7?^ .55Y?~.     
#    .Y#@@@@@G#G7!?P@@@@@@?:B@@@@@@@@@@@@@@@@@@&5?7?7?Y#@@@@@@@@@@@@@@@@@@@J:G@@@@@&P?~?G#G@@@@@#Y.   
#   ^#@@@@@@@@5^JY?!^#@&GB@5^J&@@@@@@@@@@@@@@@5~JB&@&BY~J@@@@@@@@@@@@@@@@B!!#@BG&@#^!JY?^5@@@@@@@@#^  
#  .#@@@@@@@@J ~7YG:?#?!JG@@&J~JB@@@@@@@@@@@@@.?@@@@@@@G B@@@@@@@@@@@@&P7!P@@@PJ!?#7^BY7^ Y@@@@@@@@#. 
#  ?@@@@@@@@@?JB@@G !.!@@@@@@@&577?YPB###BBPY?!:J@@@@@&^:!J5GB###BGPJ77JB@@@@@@@@~.! B@@BJJ@@@@@@@@@? 
#  5@@@@@@@@@@@@@@#~J:?@@@@@@@@@@&BPYJJJJJ?!!!?!^!#@@B^~?!^:^~7JJJY5G#@@@@@@@@@@@?:?~#@@@@@@@@@@@@@@5 
#  5@@@@@@@@@@@@@@@@&.5@@@@@@@@@@@@@@@@#Y77YPB&@@Y^YJ^5@@@&BPJ775#@@@@@@@@@@@@@@@5.&@@@@@@@@@@@@@@@@5 
#  J@@@@@@@@@@@@@@@@B B@@@@@@@@@@@@@@P!!5#@@@@@@@@#YY&@@@@@@@@@#Y!!P@@@@@@@@@@@@@B B@@@@@@@@@@@@@@@@J 
#  ^@@@@@@@@@@@@@@@@Y.&@@@@@@@@@@@@@# J@@@@@@@@@@@@@@@@@@@@@@@@@@@::&@@@@@@@@@@@@&.Y@@@@@@@@@@@@@@@@^ 
#   G@@@@@@@@@@@@@@@7~@@@@@@@@@@@@#Y~?&@@@@@@@@@@@@@@@@@@@@@@@@@@@B7!Y&@@@@@@@@@@@~7@@@@@@@@@@@@@@@G  
#   ~@@@@@@@@@@@@@@@~7@@@@@@@@@@#7~Y#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#Y~?#@@@@@@@@@7~@@@@@@@@@@@@@@@~  
#    Y@@@@@@@@@@@@@@^?@@@@@@@@@@5^~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@B:!P@@@@@@@@@?^@@@@@@@@@@@@@@Y   
#     G@@@@@@@@@@@@@~7@@@@@@@@@@&^7@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#^?@@@@@@@@@@7~@@@@@@@@@@@@@G    
#     .B@@@@@@@@@@@@7~@@@@@@@@@B^J@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&7~#@@@@@@@@~7@@@@@@@@@@@@B.    
#      .P@@@@@@@@@@@5.&@@@@@@@B !#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&B~.#@@@@@@&.5@@@@@@@@@@@P.     
#        J@@@@@@@@@@&:J@@@@@@@BJ5:Y@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@B:JYJ#@@@@@@J:&@@@@@@@@@@J       
#         ^P@@@@@@@@@5.B@@@@@@@@&.5@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#.5@@@@@@@@B.5@@@@@@@@@P^        
#           ~P@@@@@@@@?:&@@@@@@@?^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@P.B@@@@@@&:?@@@@@@@@P~          
#             :JB@@@@@@?^B@@@@@@:~5&@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@G5:~@@@@@B^?@@@@@@BJ:            
#                ^?P#@@@5^5@@@@@PP?:&@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@J:P5G@@@@5^5@@@#P?^               
#                   .^!?5? 5@@@@@@@^7@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&.5@@@@@@5 ?5?!^.                  
#                         .J#@@@@@@B.5&&@@@@@@@@@@@@@@@@@@@@@@@@@&#?:&@@@@@#Y:                        
#                           .~JG&@@@B??77G@@@@@@@@@@@@@@@@@@@@@P77??#@@&GJ~.                          
#                               .~?5B&@@G!7B&#B#@@@@@@@@@#BB&G!!G@&B5?~.                              
#                                   ??7!JY7^~7?7!?5BBB57!!7!::!J?^7J?.                                
#                                 .G@@~~BGP5J:!?7^     ^7J~:YPGB#~!@@B.                               
#                                 !@@# G@@@@@!!@@&.    #@@~7@@@@@P #@@7                               
#                                 ^@@#.P@@@@@~7@@#     B@@!~@@@@@5.&@@~                               
#                                  J@@Y:B@@@J:#@#~     ^#@#:Y@@@G:Y@@Y                                
#                                   ^7! .!7^ :77.       .!7: ^7!  !7^                                 '''
# print(login)
# print(id(login))
# print(password)
# print(id(password))
# print(line)
# print(line2)
# print(raw_line)
# print(img)
# print('''I
#             Love
#                     Python''')
# print("")

line = "football"
print(line)
print(line[0])
print(line[2])
print(line[3])
print(line[7])
print(line[-1])
print(len(line))
print(line[len(line)-1])
##конкатенація (додавання)
line1 = "Hello, "
line2 = "world"
line3 = " red"
print(line1+ line2)
line4 = line1 + line2 + line3
print(line4)

#дублювання рядків - оператор *
line = "Hello"
print(line*5)
res_line = line*10
print(res_line)

# #визначення довжини рядка
message = "Hello, world!"
print(f"Lenght of message = {len(message)}")

#name text.... name text.... age   name  text....
name = "Nazar"
age = 22
#fullLine = name + "text....." + name+ "text....." + age + name + "text...."
#fullLine = name + "text....." + name+ "text....." + str(age) + name + "text...."
#fullLine = name , "text....." , name, "text....." ,age, name , "text...."
#fullLine = "{}  text..... {} text..... {}  {} text....".format(name,name,age,name)
#fullLine = "{0}  text..... {0} text..... {1}  {0} text....".format(name,age)
fullLine = f"{name}  text..... {name} text..... {age}  {name} text...."
print(fullLine)

salary = 150.458
msg = f"Your salary is {salary:15.3f}"
print(msg)

a = -10
b = +10
myStr = f"Your number is in range : from {a:-} to {b:+}"
print(myStr)

points = 100
myStr = F"You have : {points} points"
print(myStr)
myStr = F"You have : {points:<15} points"
print(myStr)
myStr = F"You have : {points:>15} points"
print(myStr)
myStr = F"You have : {points:^15} points"
print(myStr)

line = "Lorem ipsum"
print(line)
print(id(line))
line += "!!!!!"
print(line)
print(id(line))
str = "Hello"
print(id(str))
str = "world"
print(id(str))

for i in range(10000):
    print(f"{i} --->   {chr(i)}", end="\t")
    if i%7 == 0:
        print()

print(ord("A"))
print(ord("a"))
print(ord("B"))
print(ord("b"))

print(chr(9556), end="")
print(chr(9552)*50)
print(chr(9556),chr(9552)*50)
print(f"{chr(9556)}{chr(9552)*50}")